{
    "title": "SOLO: Agis Ahunt",
    "sections": [
        {
            "heading": "Research",
            "paragraphs": [
                "Agis Spent the first day after everything rummaging through the books in the library marking updates on his maps he did not have.",
                "Some books mentioned forest clearings for larger older Vallasaari settlements revealing old ways of living, including farming. he found a note pointing the way to an old ruin in the Mistveil Woods. Before leaving he found Pryce dead, but Krant said he'd investigate more.",
                "The Mistveil woods were North of Oakhurst and while there for the night he learned of looming conflict between Harman Bryce of Carrick, Godmund Elvery of Firstwatch, and Lord Aldred of Camelbourne. Patrols in the night took note of Agis' presence but don't challenge him.",
                "",
                ""
            ]
        },
        {
            "heading": "To The Mistveils",
            "paragraphs": [
                "Oakhust is now fortifying for war. Tales of orc brigands, human bandits, etc. The locals draw on a sketch map where the attacks happen; they attack only Aldred's lands, not further South to Carrick.",
                "Agis found an old tin road used by the miners, pointing to the Crowns, and then to the Stone Tooth its highest peak. Farmers talk of old  weapons with the stamp of a forge in long-dead Khundrakar in the hands of orcs around here. Agis headed into the Mistveil Woods in the evening, and spend hours heading uphill, looking for signs of old settlements but found none.",
                "A scouting party of orcs, led by a Kazgund Orog from Kaina itself, found him and they fanned out to kill him. Two runners go back to warn others. A brief but fierce fight. He used his knowledge of these creatures to take them down swiftly and make off after the runners and kills them both at range.",
                "In his haste, he ignored the smells reaching him, but notices at the last minute a mass of movement through the trees and witness the passing of a large orc war party, perhaps hundreds strong. They are led by Orogs of the Black Hand, remnants of the army that ravaged the Kingdom decades ago.",
                "He is spotted by a few. But as they approach their sergeant, who sees nothing, keeps them in line. He says that the 'Little Man' has plans at the Stone Tooth that make it dangerous to remain near, so they march to a forward camp. Agis returns to Peridrael."
            ]
        },
        {
            "heading": "Debriefing",
            "paragraphs": [
                "Back at Peridrael, three days later, he shows them the armour of the Orog with the markings of the Black Hand and their superior made weapons. Silat begins to prepare for battle, to defend the clan hold. Irvane cautions against rash action; if something can bring warbands together and enforce the discipline of an army, it must be intelligent. And if that is so, its worth considering that it could be using the war host as a distraction. Now is time to watch and prepare, not attack.",
                "Irvane offers more gratitude for the the weapons from the orcs and will send word to Lord Aldred while Agis goes back to the Farm to reunite with everyone else."
            ]
        },
        {
            "heading": "Tales of the Dead",
            "image": "./img/orc-columns.webp",
            "paragraphs": [
                "Agis asked Irvane to contact his clan to bring them here. When Agis returned, advised had news from the Emissary of Clan Feredir. It seems that Agis Feredir died over a year ago, which was actually not long after he left the clan forests, and marks the end of the Feredir line. Nevertheless, his old clan is happy to have a new home and will prepare to journey to Camelbourne within weeks."
            ]
        }
    ]
}