{
    "title": "SOLO: Pryce on the Ward",
    "sections": [
        {
            "paragraphs": [
                "After the final battle with the Ardsere and a well deserved rest, Pryce took to exploring the books in the library, with a specific interest in tying together the mysteries that had been beguiling the party.",
                "He found an intriguing tome detailing the ravings of blasphemers and heretics who had been executed whilst raving about a 'Spider' - and sacrifice. Oddly however, these events seemed to repeat like clockwork during the season of Laments. Pryce had the sudden thought; by some providence or quirk of fate, it is Laments season right now.",
                "Pouring over the accounts of the words spoken by the doomed heretics, Pryce began to feel dizzy; he could seem to hear the words echo in his head. He closed his eyes and turned away, but the voices in his head only became clearer, and with them came an agonizing pain, which amplified and pulsed until his consciousness slipped away.",
                "He seemed to come to under an orange sky. He sat forward and perceived himself to be in a deep valley, near a tree bathed in a sickly light. The tree had the countenance of the one encountered deep in the sunless citadel, but this tree's roots were rotten and sickly, and stretched into a pit wreathed in ruins.",
                "Looking upwards, above the mountains, Pryce could see a pale sun enshrouded with clouds, and amongst the clouds flew massive shapes, as if hundreds of Abominations populated the sky. And above them, keeping a watchful eye was a creature so vast that it defied comprehension. Blotting out half of the sky and disappearing over the horizon, but so high that the clouds were beneath it, thousands of writhing tentacles moved, each with their own purpose.",
                "A vast subsonic blast split the air and caused the ground itself to vibrate; the tree creaked and groaned, pebbles on the ground began jumping and twitching - and with a gasp, Pryce came to on the floor of the library. ",
                "Having awoken from the strange vision however, his splitting headache was only getting worse. He could still hear foul voices in his head, and he felt twitchy and disconnected. There was a buzzing at the back of his skull, and the corners of his vision seemed to be alive with barely seen writhing masses.",
                "In the absence of his travelling companions, the librarian was attending to him and seemed glad to not have the responsibility of disposing of his corpse for the time being. ",
                "Coming to his senses somewhat, Pryce spotted the book on the floor and leafed through it, wondering how it was possible that it has affected him in such a way. ",
                "This action had its own consequence however, as it triggered an orange mist to begin spewing from the pages, which congealed into a bizarre ape like creature who seemed to be some kind of security warding placed on the book by the Talljon Havard. Pryce was able to deceive it into leaving him alone, and avoided another unwelcome complication to his situation.",
                "With the librarian Krant's help, Pryce was able to find references including a list of burials and cases heard at the clerical courts, which indicated that many of the madmen touched by the Spider were incarcerated at the local asylum run by the church of the Mother. ",
                "With his head throbbing from the incessant voices, Pryce knew he had to take any opportunity to clear his mind, so he resolved to visit the asylum and learn what he could. He also recalled that there was another heretic in the city that was known to the party, Faliver Whinns, a fence and book dealer with a predilection for clocks. Whinns had requested the procurement of three books within the library if they could be found. With a word to Kant, they were in hand, and Pryce had another bargaining chip.",
                "Ever cautious, Pryce asked Krant to find him some priest's robes so that he could pass for a holy person with the asylum. he doubted that in his current state the clerics there would give him the information he needed and allow him to leave.",
                "So garbed, he took his leave from the library and passed unnoticed through the cathedral and into the town in the early afternoon. He made his way to the heretical book dealer and hammered impatiently at the door.",
                "The door burst open, and there was suddenly a knife in his face, the panicked eyes of Faliver Whinns looking at Pryce's priestly robes.",
                "Pryce backed up and raised his hands. 'Think, man! You know my face. You don't think I could do my work without a cover story?'",
                "A dawning understanding slithered onto Faliver's face, and he put the knife away. 'Come in then, come in, get off the streets!', he hissed, and they were inside.",
                "Peering out a slit in the window, he made sure there was no activity outside before turning back to Pryce. He squinted at his face. 'You're not looking too good, moi friend.', he said in his cockney drawl.",
                "The two had a terse exchange; it seemed that Faliver had some knowledge, or at least suspicion as to what was going on in Pryce's head, but his ability or inclination to help was very limited. Pryce gave over the books he had requested, hoping they would do some good, or at least do the church some ill. ",
                "'Here, before you go.', Faliver straightened and adjusted the tabard of Pryce's cleric disguise. 'That looks more like it. You'd have drawn strange glances that other way. Good luck moi friend!'",
                "Pryce took his leave and headed for the asylum. Thinking of Faliver's words, he summoned an illusory cantrip around his face to cover the effects of the draining madness that had left him gaunt and bloodshot. ",
                "Pryce approached the large gate of the grand stone manor house that was the asylum. Taking a breath he rang the bell, and shortly an attendant approached and asked his business. Pryce requested an audience with the administrator, Cynowyn Berrick - on urgent business of the church. He received a cautious look, but was admitted. He was taken through into the courtyard of the complex, and met with Administrator Berrick by the fountain, for a walk-and-talk. Berrick explained in a good natured way the running of the facility, giving Pryce some time to pick up on the best way to manipulate the man to his ends.",
                "Soon they were in the foyer of the building and Berrick gestured for Pryce to sit at one of the well appointed tables to finally get down to business. 'How may I be of service to the Church, Cleric Pryce?'",
                "A story had been weaving itself in the back of Pryce's head for the last few minutes, and here was his opportunity to spin it out.",
                "'There is a new senior cleric in my order. I'm sure you know the type. Ambitious; penitent, of course. But ambitious.'",
                "Berrick gave a chuckle. 'I certainly do know the type. Go on, please.'",
                "Pryce nodded. 'This... senior cleric. He has been going through the church records, and he has found some incidents that were concerning to him. Amplifying his concern is the timing. It has been noticed that you seem to have a fresh intake of very similar... acquisitions around this season. Laments, that is.'",
                "Berrick chuckled again. 'Acquisitions? An interesting euphemism. But it is true, this is a busy season for us. Possibly the high spirits of the populous... but... perhaps more than that.' His brow furrowed. 'However the most troublesome of the inmates, those that spout heresy among their ravings... we give those to the grace of the church, and according to church law they are executed. That should be the end of the matter.'",
                "Pryce leaned in. 'But it hasn't been the end of the matter, has it? My... senior cleric, he has a most definite sense that the matter is ongoing. Every Laments. There is concern that this trend indicates a more insidious threat.'",
                "Berrick nodded, looking concerned. 'It is... a valid concern I suppose. However I'm not sure how I can help the church in this matter.'",
                "Pryce made an apologetic gesture. 'At this stage, it is just conjecture. However my... senior cleric has asked that I have a look around and make a preliminary report. I'd like to get a sense of the place and it's inhabitants, if that is no inconvenience.'",
                "Shortly, Pryce was touring the facility with Berrick.",
                "'Here is an interesting one. Probably the most dangerous inmate we have at the moment.' Pryce was introduced - through a small slit in a cell door - to Master Florian Veldrun. The man was dressed in well cut clothing that now looked as though they had seen better days. He also had a set of rather ornate manacles binding his hands. ",
                "'Florian here fled from the town of Wikkensmeade, after an... unfortunate incident. He was an antique dealer as I recall. Isn't that right, Florian?'",
                "After a guarded exchange with Florian, it became obvious that there was another entity inhabiting his head. Pryce cautiously made contact with it telepathically, and determined that it was  demonic in nature. Interesting perhaps, and it might have something to offer - but more likely a distraction. ",
                "They moved on to the east wing, and Pryce immediately doubled over and almost stumbled as the pain spiked in his head. Berrick did not seem to notice and Pryce struggled through. they arrived at a cell which was last inhabited by one of the inmates that had been touched by the Spider, Pryce was certain of it. Berrick explained that before the inmate had been executed, he had covered the walls of his cells in bizarre symbols scraped into the stone. In order to rid the place of the profane writing, they had plastered over it. Pryce knew immediately that whatever was behind that plaster had the answers that he sought.",
                "Berrick wrapped up the tour and Pryce made a show of gratitude and acquiescence, but asked to be allowed some time in the foyer to write up his notes while his experience was still fresh. This was granted, and Pryce sat himself at a foyer table and made doodles in a journal while he decided on his next move. ",
                "There was an attendant a respectful distance away, but who was obviously tasked with keeping an eye on their guest. Pryce approached him, reached out with his mind, and seized the man's will in an iron fist. 'I am an honoured guest who has been granted a tour of this facility,' Pryce commanded him, 'You will show me to wherever I need to go and ensure I am not disturbed under any circumstances.'",
                "Pryce had the attendant lead him unseen back to the newly plastered cell, and extracted a promise that not a soul would disturb him. Pryce took a deep breath, and his pocket knife, and set to work. ",
                "Pryce's time in that cell is not to be spoken of to the uninitiated. Suffice to say, he found the cure that he was looking for, and more besides.",
                "Another command to his thrall and Pryce was soon safely outside the facility. He turned and strode north along the streets, and soon a wide grin split his face as he savoured his victory."
            ]
        },
        {
            "image": "./img/crone.webp",
            "paragraphs": [
                "He was not far from home when he felt a sudden bruising impact on the back of his head. He spun round to see a wizened older woman in ornate robes and spittle on her chin bearing down on him. 'What did you do?' she screamed, 'What did you find? Give it to me!'",
                "Pryce recognised the silver adornments on her robes as the silver he had brought to the silversmith in Caer Camlyn - and he began to fit the pieces together in his mind. ",
                "But the old warlock was still coming at him, and she drew a shimmering sword that was glowing and humming in a way that he had never seen. Grimacing, Pryce summoned thunder, but the old woman cast a Counterspell, nullifying his final reserve of potent magic. He summoned a blast of eldritch energy that knocked her backwards, and then he fled down the cobbled street, trying to gain distance. ",
                "She  caught up and struck him with the sword, causing a great wound. He dodged round the corner, and in significant pain he pulled his cloak round him, shifted between dimensions, and escaped his pursuer. ",
                "As he tended his wounds that evening, he swore that the next time they met, he would be the hunter."
            ]
        }
    ]
}