{
    "title": "SOLO: Rachel's Recollections",
    "sections": [
        {
            "paragraphs": [
                "It wasn't long before Rachel and Riswynn returned to the farm, bringing with them some extra horses they had seemingly 'acquired'. That night as Rachel sat at the dinner table she seemed more settled than usual, as if a weight had been lifted from her shoulders.",
                "“So.. what happened ?”",
                "“Well.. “  she began.",
                "“Not long after you left the library, Pryce collapsed, Krant thought he was dead, he looked it. Valthoom was still there though, so we assumed that at least some part of Pryce was still alive, somewhere.  Anyway, Krant said he’d take care of Pryce If we had to go. Which was good because Riswynn had some sort of dream and wanted to leave.",
                "She said it was Meepo, the Kobold from the Gorge. He’d come to her in a vision asking for help. Riswynn wanted to go look for him at the Gorge, where he’d been killed, she asked if I would go with her..”",
                "Rachel shrugs. as if to say, 'what else could I do?' With a small cough she continues.",
                "“Risywnn knew this street urchin who helped us sneak out of Tarrowby, and we headed to Hamber. Noote was there already, preparing for the Laments festival. We had some food at the Inn and spent the night..”",
                "A thoughtful look crosses Rachel’s face, ",
                "“.. Someone mentioned that Bragi had been there about a week before, but that seemed odd, Bragi would have been with us at that time. Unless there’s two Bragi’s. hehe. We joked that Bragi had an evil twin, we named him ‘Thagi’ .",
                "Anyway, we left the next day and headed to Oarkhurst. We got there without any trouble. We did hear from some farmers that Orcs had been seen coming south from the forests, though none had been seen south of the Averwick river. We didn’t’ see any though.",
                "When we got to Oakhurst the man at the Old Boar inn, you know the one that runs the place, well he told us about a party of Adventurers that were also heading to the Gorge. They’d read a letter on the notice board that said Adventurers wanted, to clear the citadel …” Rachel pauses thoughtfully. ",
                "“It was signed by Kerrick Farnham, he was one of the soldiers from Elswatch.",
                "Anyway, we headed to the Gorge , careful though. We spotted a campsite at the top of the stairs. Paid off two guards. Tricked another,  lured him into an ambushed.” ",
                "Another thoughtful pause.",
                "“He died..”",
                "“Further inside we saw the spirit of Meepo. it just floated there, Spirit Meepo with his Spirit rope. It beckoned us to follow and lead us to a chamber where other kobolds were waiting. These ones were still alive.”",
                "Rachel takes a moment to sit her glass of milk.",
                "“They explained that there was a party of raiders trying to attack them, they’d laid traps and some illusions to protect themselves, but the raiders would break in soon.",
                "We could hear then,  hammering at a door."
            ]
        },
        {
            "image": "./img/Rachel.webp",
            "paragraphs": [
                "They thought they were just going to face some kobolds but got a surprise when they broke in and saw Riswynn and me. Tngs didn’t last long. I think a couple of the kobolds were killed, but we were ok.",
                "Two of the raiders died, we killed one of them twice. They had this knight in armour, he fell and looked like he was dead. Then their magic-user fed him a potion and  he got back up. So we had to kill him again. The other one that died was a half orc. That one stayed dead though. A third raider ran away, one of the little people, we didn’t see him again. ",
                "The last was a mage, she surrendered. A Vallasaari, named Sirithall I think. We spoke to her for a bit and then let her go. She told us the halfling that ran away was named Trosti Snell and the knight that died was Gallard Brightmane.“",
                "Rachel glances around the room, perhaps looking  to see if anyone recognises the names.",
                "“Sirithall also said that it was ‘the fidgeter’ that had recruited them - wasn’t that the nickname that the guards at Elswatch called the halfling there, the one with the red shoes. Fiddius, that was his name.  Sirithall said there was something he wanted; some treasure hidden in the citadel. “",
                "Rachel pauses.. “I think he was after this…”",
                "Rachel reaches inside her pack and carefully places a neatly folded bundle of black cloth upon the table. ",
                "“It’s dragon scale I think, black dragon. But it feels more like silk than rough scales. It’s been made into a cloak, quite small though, like it was made for a halfling, or a girl..”"
            ]
        }
    ]
}