{
    "title": "SOLO: Rachel's Recollections",
    "sections": [
        {
            "heading": "Leaving Tarrowby",
            "paragraphs": [
                "The weary travellers had departed Tarrowby with heavy hearts, leaving behind a town preparing for war. Military banners flew in the wind as Lord Mallory Avon's retinue passed through, and a ragtag but devoted militia trained in the streets under watchful eyes. Before departing, Rachel had traded a precious moonstone for the preservation of their trophy - the catoblepas eyes, now carefully pickled and stored away."
            ]
        },
        {
            "heading": "The Task At Hand",
            "paragraphs": [
                "Through their inquiries with Sergeant Glacco Twan and eventually Gwen Redsparrow, they learned of Agis's passage toward the Stone Tooth, bearing a scroll that promised magical transport back to Gwen's observatory at Caer Camlyn. But the mission was clear: investigate the Stone Tooth, deny the orcs a safe haven, and find out more about this 'great weapon' the captured orc spy spoke about. After careful deliberation over their route, they chose the southern path through Casterbridge, deeming the northern river route too slow and the direct path through Caer Camlyn too perilous.",
                "Their journey took them first to Hamber, where they encountered the slightly tipsy Noote, who declined to join them, citing orders from the Ardseer to remain. With the aid of two farmhands, Hengit Ossen and Riffik Doral, they made their way to Tomwood lumber camp, where they secured passage downriver by barge."
            ]
        },
        {
            "heading": "The Battle of the Barge",
            "paragraphs": [
                "As dusk approached, the peaceful journey was shattered by Bragi and Rachel's keen eyes spotting three massive figures lurking in the tree line along the northern bank. Trolls! The creatures emerged from the shadows, their intentions clearly hostile.",
                "The battle erupted with the twang of Bragi's crossbow, followed by his thrown axe finding its mark in the nearest troll. Pryce chanted darkly, and in an impressive display of power, one of the trolls simply vanished, banished to another realm. The remaining trolls pressed their attack, with Riswynn and Nilsen engaging the wounded beast as it attempted to clamber aboard their vessel.",
                "Rachel, her eyes glowing with arcane energy, hexed the final troll before unleashing a devastating barrage of magic missiles that tore into its flesh. The wounded troll, now aboard the barge, lashed out at Riswynn with terrible claws, but Nilsen's swift blade answered, separating the creature's head from its shoulders in one clean stroke."
            ]
        },
        {
            "heading": "One Point One Trolls Remaining",
            "image": "./img/rivertroll.webp",
            "paragraphs": [
                "The battle was far from over, however. The remaining troll hurled a massive rock, striking Rachel despite her defensive maneuvers. She maintained her concentration on the hex through sheer force of will, retaliating with a mental assault before ducking behind a bench for cover. Bragi's magical whispers sent the hexed troll fleeing in terror, while Pryce's eldritch blast pushed it further into retreat.",
                "In a grotesque turn, the decapitated troll's head sprang back to life, its jaws clamping down on Nilsen. Rachel's conjured stone struck true, and Bragi's rapier finally ended the head's unnatural animation. Riswynn unceremoniously tossed the twice-dead head into the river, and they watched as the last hexed troll stumbled away into the gathering darkness.",
                "As the adrenaline of battle faded, the barge continued its journey toward Casterbridge, leaving behind only ripples in the water and the echoing memory of their victory against the trolls."
            ]
        }
    ]
}